<!doctype html public "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>Sicherheit von Daten in Netzen</title>
<meta name="author" content="Mirko Hans">
<meta name="generator" content="Ulli Meybohms HTML EDITOR">
<link rel="stylesheet" href="../../../scripts/css/screen.css" type="text/css" media="screen,projection">
<link rel="stylesheet" href="../../../scripts/css/print.css" type="text/css" media="print">
</head>
<body>
<A NAME="sicherheit"></A>

<div align="center">
<H1>Sicherheit von Daten in Netzen</H1>
</div>

<HR WIDTH="80%">

<div class="text">

<p>Bei der Nutzung von Diensten, die moderne Netzwerke zur Verf&uuml;gung stellen, ist darauf zu achten, dass grunds&auml;tzlich alle an das Netzwerk angeschlossenen Benutzer Zugriff auf die hinterlegten Daten haben. Nur in den seltensten F&auml;llen sind diese Daten aber f&uuml;r alle Benutzer gedacht. Meist m&ouml;chte der Besitzer der Daten nicht, dass diese auch anderen Benutzern zug&auml;nglich sind. Aus diesem Grund gilt es, die pers&ouml;nlichen Daten in einem Netzwerk vor unbefugtem Zugriff und missbr&auml;uchlicher Nutzung zu sch&uuml;tzen.</p>

<p>In dieser Unterrichtseinheit sollen zun&auml;chst erst einmal Probleme aufgezeigt werden, die beim Austausch und Ablegen von Daten in Netzwerken entstehen k&ouml;nnen. Anschlie&szlig;end gilt es entsprechende Schutzma&szlig;nahmen zu untersuchen.</p>

<h4>Gruppenarbeit zu Datensicherheit und Datenschutz in Rechnernetzen</h4>

<ol start="1" type="1">
<li>Zur Betrachtung von Webseiten wird eine spezielle Software (so genannter <span class="hervorhebung">"Browser"</span>) ben&ouml;tigt. Dieser stellt damit eine m&ouml;gliche Schwachstelle beim Surfen im Internet dar. Erl&auml;utern Sie die Ziele, die mit den Technologien <span class="hervorhebung">"Cookies"</span>, <span class="hervorhebung">"Browsercache"</span> und <span class="hervorhebung">"History des Browsers"</span> verfolgt werden sowie die jeweils damit verbundene Sicherheitsproblematik! Siehe hierzu u. a. "Praktische Informatik mit Delphi" Band 1 S. 123ff. sowie Band 2 S. 85f.</li>
<li>Beschreiben Sie weitere Probleme der Datensicherheit im Zusammenhang mit der Nutzung des Internets (z.B. Online-Banking, Soziale Netzwerke, Phishing, Viren)!<br>Einen guten Einstieg  zur Sicherheit beim Online-Banking bietet hier die folgende Seite der <a class="extern" href="https://www.sparkasse-oberlausitz-niederschlesien.de/de/home/service/sicherheit-im-internet.html?n=true&stref=service_links" target="_blank">Sparkasse Oberlausitz-Niederschlesien</a>. <br>Einige interessante Einsichten zum Datenschutz in Sozialen Netzwerken findet man in dem folgenden Artikel der Zeitschrift c't: <a target="_blank" href="http://www.heise.de/ct/artikel/Datenschutz-Fallrueckzieher-1153312.html">Datenschutz Fallrueckzieher</a></li>
<li>Erl&auml;utern Sie kurz einige M&ouml;glichkeiten wie sich ein Nutzer gegen die oben genannten Probleme sch&uuml;tzen kann (z.B. Virenscanner, Firewall, Verschl&uuml;sseln von zu &uuml;bertragenden Daten (Kryptografie), Zugriffsrechte)!</li>

</ul>

<li>Weitere Schutzma&szlig;nahmen</li>

<ul>
<li>Entscheidend f&uuml;r den zuverl&auml;ssigen Schutz der pers&ouml;nlichen Daten ist die Wahl sicherer <span class="hervorhebung">Passw&ouml;rter</span>. Welche Regeln f&uuml;r die Vergabe sicherer Passw&ouml;rter sollte man unbedingt beachten (<span class="hervorhebung">Kleiner Leitfaden Informatik</span>, S. 87 - 88)?</li>
<li>Professionelle Betriebssysteme wie Windows 7 Professional und Unix gestatten dem Benutzer die Vergabe von <span class="hervorhebung">Zugriffsrechten</span>. Meist k&ouml;nnen die Rechte <span class="quelltext">read</span>, <span class="quelltext">write</span> und <span class="quelltext">execute</span> an bestimmte Personen oder Gruppen von Personen vergeben werden. Damit kann detailliert festgelegt werden, wer welche Zugriffsrechte auf die Dateien hat.</li>
<li>Bei der Kommunikation zwischen Rechnern in Netzwerken werden die Daten standardm&auml;&szlig;ig offen, d.h. unverschl&uuml;sselt &uuml;bermittelt. Damit ergeben sich sofort zwei Probleme: <br>
<dl>
<dt>- ein potenzieller Angreifer k&ouml;nnte sich durch Abfangen einer Nachricht Zugriff zu brisanten Daten  verschaffen,<dd>
<dt>- ein potenzieller Angreifer k&ouml;nnte eine Nachricht im Netz abfangen und eine eigene Nachricht einschleusen, so dass der Empf&auml;nger der Nachricht falsche Informationen untergeschoben bekommt.<dd>
</dl>
Beide Probleme lassen sich durch <span class="hervorhebung">Verschl&uuml;sselung</span> und <span class="hervorhebung">Digitale Signatur</span> l&ouml;sen. Wir wollen darauf in einer der n&auml;chsten Stunden noch einmal genauer eingehen, wenn wir uns mit den Grundz&uuml;gen der <span class="hervorhebung">"Kryptologie"</span> etwas eingehender befassen werden.<br>
Arbeitsblatt zur Kryptologie: <a class="intern" href="dateien/AB_Kryptografie_Aufg.pdf">AB_Kryptografie_Aufg.pdf</a>
</li>
</ul>
</ol>

<h5>Materialien</h5>

<ul>
<li><a href="http://de.wikipedia.org/wiki/Computersicherheit">Wikipedia - Computersicherheit</a></li>
<li><a href="http://de.wikipedia.org/wiki/Phishing"> Wikipedia - Phishing</a></li>
<li><a href="http://de.wikipedia.org/wiki/Kryptografie">Wikipedia - Kryptografie</a></li>
<li><a href="http://de.wikipedia.org/wiki/Zugriffsrecht">Wikipedia - Zugriffsrecht</a></li>
</ul>

<p>Zusammenfassung: <a class="intern" href="dateien/DS_Dasi_Netzwerke.pdf">DS_Dasi_Netzwerke.pdf</a></p>

<HR WIDTH="80%">

<div class="nichtdrucken">

<div align="center"><A HREF="../kl_9_10.htm#kl_9_10"><IMG Border=0 SRC="../../../bilder/prev.gif"></A>
<A HREF="../../../index.htm#Home"><IMG Border=0 SRC="../../../bilder/home.gif"></A>
<A HREF="mailto:m_hans@gmx.de"><IMG Border=0 SRC="../../../bilder/t_post.gif"></A></div>

</div>

<p><div class="sehr_klein">zuletzt ge&auml;ndert am:

<script language="JavaScript">
<!--
 document.write(document.lastModified);
//-->
</script>

<br>
Eine Seite von <a href="mailto:m_hans@gmx.de">Mirko Hans</a></div></p>

</div>

</body>
</html>